import React, {PureComponent} from 'react'
import {View,Text,TouchableWithoutFeedback, SectionList,StyleSheet,RefreshControl} from 'react-native'
import {
  Container,
  ListItem,
  Card,
  CardItem,
} from 'native-base';
import CommonHeader from "../components/CommonHeader";

export default class StyleView extends PureComponent {
  state = {
    styleData: {
      "一笔艺术签名"  : "901",
      "一笔商务签"   : "905",
      "一笔签名体"  : "6",
      "连笔草书"  : "21",
      "连笔草书字"  : "22",
      "连笔艺术字"  : "396",
      "连笔手写字"  : "398",
      "行楷"  : "2",
      "手写字"  : "16",
      "疾风草书体"  : "7",
      "宋体" : "b",
      "黑体" : "a",
      "行楷简" : "2",
      "行楷繁" : "9",
      "舒同"  : "13",
      "行书"  : "17",
      "隶书"  : "18",
      "隶书繁"  : "19",
      "仿宋体"  : "313",
      "菱心"  : "0",
      "秀英"  : "1",
      "雁翔"  : "4",
      "双线"  : "10",
      "雪峰"  : "12",
      "古文篆书" : "14",
      "花蝶" : "301",
      "彩蝶" : "302",
      "飞翔" : "303",
      "萝卜文"  : "304",
      "火柴文"  : "305",
      "太极文"  : "306",
      "嘟嘟字"  : "308",
      "水波文字"  : "311",
      "空心体"  : "384",
      "书法字体"  : "385",
      "书法体"  : "386",
      "怪怪体"  : "387",
      "钢笔字"  : "388",
      "和楷体" : "389",
      "手写体" : "390",
      "灵芝体" : "391",
      "鼠标体" : "392",
      "硬草书"  : "393",
      "小丸子"  : "394",
      "明星手写体"  : "5",
      "大草体字"  : "395",
      "娃娃字体"  : "3",
      "空心咪咪体"  : "11",
      "个性繁中变"  : "15",
      "黛玉字体"  : "307",
      "凌波字体"  : "309",
      "清韵字体"  : "310",
      "猫猫字体" : "312",
      "卡通字体" : "397",
      "毛笔字体" : "399",
      "金文大篆体字" : "23",
      "小篆字体"  : "24",
      "篆书篆体字"  : "25",
      "一起去看海"  : "314",
      "一起恋爱"  : "315",
      "万圣节快乐"  : "316",
      "且听风吟"  : "317",
      "他夏了夏天"  : "318",
      "你最疼爱的人"  : "319",
      "信心相随"  : "320",
      "单翼雪蝶"  : "321",
      "南辞遇蝶" : "322",
      "卷卷爱红唇" : "323",
      "后会有期" : "324",
      "咯咯哒的梦想" : "325",
      "圈圈泡泡"  : "326",
      "地狱引路人"  : "327",
      "夏天的风"  : "328",
      "天使恋曲"  : "329",
      "天空的距离"  : "330",
      "失忆蝴蝶结"  : "331",
      "安静的美女子"  : "332",
      "小兔闹革命"  : "333",
      "小肥泡中文"  : "334",
      "幸福四叶草"  : "335",
      "开开的蛋糕" : "336",
      "恋爱写真" : "337",
      "恋爱蝴蝶结" : "338",
      "恬夕别乱" : "339",
      "恬夕恋夕"  : "340",
      "恰逢其会"  : "341",
      "情书常规体"  : "342",
      "我是小天使"  : "343",
      "我爱他到白发"  : "344",
      "手写楷书"  : "345",
      "手写硬笔行书"  : "346",
      "时装静蕾字体"  : "347",
      "星光夜空爱情"  : "348",
      "星心甜甜圈"  : "349",
      "星火爱情" : "350",
      "星际Cream" : "351",
      "春天小蜜蜂" : "352",
      "暮夏何其孽" : "353",
      "梦中的婚礼"  : "354",
      "梦巴黎"  : "355",
      "楼花幽情"  : "356",
      "水果大联盟"  : "357",
      "泡泡猫"  : "358",
      "浮沉繁花"  : "359",
      "烟花易冷"  : "360",
      "玉米荡漾"  : "361",
      "甜菜五道杠"  : "362",
      "空心粉简洁"  : "363",
      "红星朵朵开" : "364",
      "线条的故事" : "365",
      "绿光森林" : "366",
      "美丽月亮船" : "367",
      "腾祥倩影简" : "368",
      "腾祥相思简" : "369",
      "花俏公主" : "370",
      "花落寄相思" : "371",
      "花里胡哨" : "372",
      "草莓之心" : "373",
      "荼蘼花开" : "374",
      "葬的彼岸" : "375",
      "蝴蝶结云彩" : "376",
      "蝶恋之樱" : "377",
      "请叫我天然萌" : "378",
      "迪斯尼美丽" : "379",
      "钻石绵羊" : "380",
      "阿苗笑笑" : "381",
      "阿霏蓝天梦" : "382",
      "马卡龙方块" : "383"
      }

  }

  componentDidMount () {

  }

  componentWillUnmount () {

  }

  componentWillReceiveProps () {

  }

  _renderStyleListView () {
    this.state.styleData.map((item, index) => {
      console.log(item)
    })
  }
  render () {
    return (
      <Container style={{position: 'relative'}}>
        <CommonHeader title="选择风格" canBack {...this.props}></CommonHeader>
        <View>
          <Text> 风格 </Text>
        </View>
        {this._renderStyleListView()}
      </Container>
    )
  }
}